import 'node-fetch';
let handler = async (_0xfe75e0, {
  conn: _0x17c30a,
  usedPrefix: _0xa30c3b,
  usedPrefix: _0x500029,
  __dirname: _0xb25ad9,
  text: _0xc0e03f,
  isPrems: _0x3d7d4d
}) => {
  try {
    let _0x1f0ffe = new Date(new Date() + 3600000);
    let _0x1a75bf = _0x1f0ffe.toLocaleDateString('es', {
      'day': "numeric",
      'month': "long",
      'year': "numeric"
    });
    let _0x15de06 = process.uptime() * 1000;
    let _0x2b1cf8 = clockString(_0x15de06);
    let _0x4d0ae4 = global.db.data.users[_0xfe75e0.sender];
    let {
      money: _0x437d16,
      joincount: _0x5008fa
    } = global.db.data.users[_0xfe75e0.sender];
    let {
      exp: _0x1b009,
      limit: _0x1fab78,
      level: _0x4aacc6,
      role: _0x1646c9
    } = global.db.data.users[_0xfe75e0.sender];
    let _0x460bdc = Object.values(global.db.data.users).filter(_0xf55cb8 => _0xf55cb8.registered == true).length;
    let _0x504d1f = '@' + _0xfe75e0.sender.split("@s.whatsapp.net")[0];
    let _0x14f1f6 = ("╭════〘 𝐓𝐑𝐀𝐂𝐄 𝐌𝐃 〙════⊷\n║ 𝗛𝗲𝗹𝗹𝗼 " + _0x504d1f + "👋\n\n║ 𝗔𝘂𝘁𝗵𝗼𝗿: wa.me/254786273945\n║ 𝗬𝗼𝘂𝗧𝘂𝗯𝗲: https://youtube.com/@WillisKE\n║ ︎𝗗𝗮𝘁𝗲: " + _0x1a75bf + "\n║ ︎𝗨𝗽𝘁𝗶𝗺𝗲: " + _0x2b1cf8 + "\n╰══════════════════⊷\n\n╭════〘 𝐓𝐑𝐀𝐂𝐄 𝐌𝐃 〙════⊷\n╰══════════════════⊷\n┏━━━━━━━━━━━━━━━━━\n┃𝐓𝐑𝐀𝐂𝐄 𝗧𝗘𝗦𝗧-𝗕𝗢𝗧\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣ .𝗮𝗹𝗶𝘃𝗲\n┣ .𝗯𝗼𝘁\n┣ .𝗿𝘂𝗻𝘁𝗶𝗺𝗲\n┣ .𝗽𝗶𝗻𝗴\n┣ .𝗶𝗻𝗳𝗼𝗯𝗼𝘁\n┣ .𝘀𝗰/𝘀𝗰𝗿𝗶𝗽𝘁\n┣ .𝘀𝗽𝗲𝗲𝗱𝘁𝗲𝘀𝘁\n┣ .𝘁𝘆𝗰/𝘁𝗲𝗿𝗺𝘀\n┣ .𝘀𝘁𝗮𝘁𝘀𝗲𝗿𝘃𝗲𝗿\n┗━━━━━━━━━━━━━━━━┛\n┏━━━━━━━━━━━━━━━━┓\n┣𝐓𝐑𝐀𝐂𝐄 𝗔𝗜-𝗦𝗘𝗔𝗥𝗖𝗛\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣.𝗮𝗶 𝗰𝗵𝗮𝘁𝗴𝗽𝘁2\n┣.𝗮𝗶 𝗼𝗽𝗲𝗻𝗮𝗶\n┣.𝗮𝗶 𝗰𝗵𝗮𝘁𝗴𝗽𝘁𝘃𝗼𝘇\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━━\n┃𝐓𝐑𝐀𝐂𝐄 𝗠𝗘𝗡𝗨\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣ .𝗹𝗶𝘀𝘁𝗰𝗺𝗱\n┣ .𝗮𝘂𝗱𝗶𝗼𝘀\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━━\n┃𝐓𝐑𝐀𝐂𝐄 𝗠𝗜𝗣𝗜𝗟𝗢𝗧-𝗠𝗘𝗡𝗨\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣.𝗱𝗲𝗹𝗲𝘁𝗲𝗯𝗼𝘁\n┣.𝘀𝗲𝗿𝗯𝗼𝘁\n┣.𝘀𝗲𝗿𝗯𝗼𝘁𝗯𝗿𝗼𝗮𝗱𝗰𝗮𝘀𝘁\n┣.𝘀𝗲𝗿𝗯𝗼𝘁𝗰𝗼𝗱𝗲\n┣.𝘀𝗲𝗿𝗯𝗼𝘁𝗶𝗻𝗳𝗼\n┣.𝘀𝘁𝗼𝗽𝗯𝗼𝘁\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━┓\n┃ *< 𝐓𝐑𝐀𝐂𝐄 𝗖𝗢𝗡𝗩𝗘𝗥𝗧𝗘𝗥-𝗠𝗘𝗡𝗨𝕊 />*\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣ .𝘁𝗼𝗮𝗻𝗶𝗺𝗲\n┣ .𝘁𝘁𝘀2\n┣ .𝘁𝘁𝘀\n┣ .𝘁𝗼𝘃𝗶𝗱𝗲𝗼/𝘁𝗼𝘃𝗶𝗱\n┣ .𝘁𝗼𝘂𝗿𝗹\n┣ .𝘁𝗼𝗽𝘁𝘁\n┣ .𝘁𝗼𝗺𝗽3\n┣ .𝘁𝗼𝗶𝗺𝗴\n┣ .𝘁𝗼𝗴𝗶𝗳\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━┓\n┃ *< 𝐀𝐂𝐓𝐈𝐕𝐀𝐓𝐄 𝐎𝐑 𝐃𝐈𝐒𝐀𝐂𝐓𝐈𝐕𝐀𝐓𝐄\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣ _" + _0xa30c3b + "𝗲𝗻𝗮𝗯𝗹𝗲 *welcome*_\n┣ _" + _0xa30c3b + "𝗱𝗶𝘀𝗮𝗯𝗹𝗲 *welcome*_\n┣ _" + _0xa30c3b + "*enable* *modohorny*_\n┣ _" + _0xa30c3b + "*disable* *modohorny*_\n┣ _" + _0xa30c3b + "*enable* *antilink*_\n┣ _" + _0xa30c3b + "disable* *antilink*_\n┣ _" + _0xa30c3b + "*enable *antilink2*_\n┣ _" + _0xa30c3b + "*disable* *antilink2*_\n┣ _" + _0xa30c3b + "*enable* *detect*_\n┣ _" + _0xa30c3b + "disable* *detect*_\n┣ _" + _0xa30c3b + "*enable *audios*_\n┣ _" + _0xa30c3b + "*disable* *audios*_\n┣ _" + _0xa30c3b + "*enable* *autosticker*_\n┣ _" + _0xa30c3b + "*disable* *autosticker*_\n┣ _" + _0xa30c3b + "*enable* *antiviewonce*_\n┣ _" + _0xa30c3b + "*disable* *antiviewonce*_\n┣ _" + _0xa30c3b + "*enable* *antitoxic*_\n┣ _" + _0xa30c3b + "*disable* *antitoxic*_\n┣ _" + _0xa30c3b + "*enable* *antitraba*_\n┣ _" + _0xa30c3b + "*disable* *antitraba*_\n┣ _" + _0xa30c3b + "*enable* *antiarabes*_\n┣ _" + _0xa30c3b + "*disable* *antiarabes*_\n┣ _" + _0xa30c3b + "*enable* *modoadmin*_\n┣ _" + _0xa30c3b + "*disable* *modoadmin*_\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━┓\n┃ *< 𝐓𝐑𝐀𝐂𝐄 𝗗𝗢𝗪𝗡𝗟𝗢𝗔𝗗𝗘𝗥-𝗠𝗘𝗡𝗨 />*\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣  .𝗮𝗽𝗸 (𝗻𝗮𝗺𝗲)\n┣  .𝗱𝗼𝘄𝗻𝗹𝗼𝗮𝗱 (𝘆𝘁 𝗹𝗶𝗻𝗸)(𝗳𝗼𝗿 𝗵𝗲𝗮𝘃𝘆 𝗺𝗶𝘅 𝗳𝗶𝗹𝗲𝘀)\n┣  .𝗳𝗮𝗰𝗲𝗯𝗼𝗼𝗸 (𝗹𝗶𝗻𝗸)\n┣  .𝗴𝗱𝗿𝗶𝘃𝗲 (𝗹𝗶𝗻𝗸)\n┣  .𝗴𝗶𝘁𝗰𝗹𝗼𝗻𝗲 (𝗹𝗶𝗻𝗸)\n┣  .𝗶𝗴/𝗶𝗻𝘀𝘁𝗮𝗴𝗿𝗮𝗺 (𝗹𝗶𝗻𝗸)\n┣  .𝗶𝗴𝘀𝘁𝗮𝗹𝗸 (𝘂𝘀𝗲𝗿𝗻𝗮𝗺𝗲)\n┣  .𝗶𝗴𝘀𝘁𝗼𝗿𝘆 (𝘂𝘀𝗲𝗿𝗻𝗮𝗺𝗲)\n┣  .𝗴𝗶𝗺𝗮𝗴𝗲 (𝗻𝗮𝗺𝗲)\n┣  .𝗺𝗲𝗱𝗶𝗮𝗳𝗶𝗿𝗲 (𝗹𝗶𝗻𝗸)\n┣  .𝗽𝗶𝗻𝘁𝗿𝗲𝘀𝘁 (𝗹𝗶𝗻𝗸/𝗻𝗮𝗺𝗲)\n┣  .𝗽𝗹𝗮𝘆 (𝗻𝗮𝗺𝗲 𝗼𝗳 𝘀𝗼𝗻𝗴)\n┣  .𝗣𝗹𝗮𝘆𝗱𝗼𝗰 (𝗻𝗮𝗺𝗲 𝗼𝗳 𝘀𝗼𝗻𝗴)\n┣  .𝗽𝗽𝘁𝗶𝗸𝘁𝗼𝗸 (𝘂𝘀𝗲𝗿𝗻𝗮𝗺𝗲)\n┣  .𝗿𝗶𝗻𝗴𝘁𝗼𝗻𝗲 (𝗲𝗻𝘁𝗲𝗿 𝗻𝗮𝗺𝗲)\n┣  .𝘀𝘁𝗶𝗰𝗸𝗲𝗿𝗽𝗮𝗰𝗸 (𝗻𝗮𝗺𝗲)\n┣  .𝘁𝗶𝗸𝘁𝗼𝗸 (𝘁𝗶𝗸𝘁𝗼𝗸 𝗹𝗶𝗻𝗸)\n┣  .𝘁𝗶𝗸𝘁𝗼𝗸𝘀𝘁𝗮𝗹𝗸 (𝘁𝗶𝗸𝘁𝗼𝗸 𝘂𝘀𝗲𝗿𝗻𝗮𝗺𝗲)\n┣  .𝘁𝘄𝗶𝘁𝘁𝗲𝗿 (𝗹𝗶𝗻𝗸)\n┣  .𝘆𝘁𝗺𝗲𝘁𝗮/𝘆𝘁𝗲𝘀𝘁 (𝘆𝘁 𝗹𝗶𝗻𝗸)\n┣  .𝘆𝘁𝘃 (𝗹𝗶𝗻𝗸/𝗻𝗮𝗺𝗲 𝗼𝗳 𝘀𝗼𝗻𝗴)\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━┓\n┃𝗧𝗬𝗥𝗔𝗫𝗘𝗦 𝗙𝗨𝗡-𝗠𝗘𝗡𝗨\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣.𝗖𝗵𝗮𝗿𝗮𝗰𝘁𝗲𝗿\n┣.𝗗𝗮𝗿𝗲\n┣.𝗗𝗶𝘃𝗼𝗿𝗰𝗲\n┣.𝗗𝗼𝘅\n┣.𝗚𝗮𝘆\n┣.𝗛𝗮𝘁𝗲\n┣.𝗟𝗼𝘃𝗲\n┣.𝗠𝗮𝗿𝗿𝘆\n┣.𝗣𝗲𝗿𝘀𝗼𝗻𝗮𝗹𝗶𝘁𝘆\n┣.𝗽𝗶𝗰𝗸𝘂𝗽𝗹𝗶𝗻𝗲\n┣.𝗽𝗿𝗼𝗽𝗼𝘀𝗲\n┣.𝗾𝘂𝗲𝘀𝘁𝗶𝗼𝗻\n┣.𝗥𝗲𝘁𝗼\n┣.𝘀𝗶𝗺𝗶\n┣.𝗧𝗼𝗽\n┣.𝗧𝗼𝗽𝘀\n┣.𝗧𝗿𝘂𝘁𝗵\n┣.𝘄𝗮𝘀𝘁𝗲\n┣.𝘇𝗼𝗱𝗶𝗮𝗰\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━┓\n┃𝐓𝐑𝐀𝐂𝐄 𝗚𝗔𝗠𝗘-𝗠𝗘𝗡𝗨\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣ ඬ⃟ 🎮 .𝗧𝗧𝗧\n┣ ඬ⃟ 🎮 .𝗯𝗶𝗯𝗹𝗲\n┣ ඬ⃟ 🎮 .𝗴𝘂𝗲𝘀𝘀𝗳𝗹𝗮𝗴\n┣ ඬ⃟ 🎮 .𝗴𝘂𝗲𝘀𝘀𝘀𝗼𝗻𝗴\n┣ ඬ⃟ 🎮 .𝗺𝗮𝘁𝗵𝘀\n┣ ඬ⃟ 🎮 .𝗽𝗶𝘀𝘁𝗮\n┣ ඬ⃟ 🎮 .𝗽𝗽𝘁\n┣ ඬ⃟ 🎮 .𝗿𝗶𝗱𝗱𝗹𝗲\n┣ ඬ⃟ 🎮 .𝘀𝗹𝗼𝘁\n┣ ඬ⃟ 🎮 .𝘀𝘂𝗶𝘁𝗽𝘃𝗽\n┣ ඬ⃟ 🎮 .𝘄𝗼𝗿𝗱𝗳𝗶𝗻𝗱\n┣ ඬ⃟ 🎮 .𝗧𝗿𝘆𝗹𝘂𝗰𝗸\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━┓\n┃ *< 🪀𝐓𝐑𝐀𝐂𝐄 𝗚𝗥𝗢𝗨𝗣-𝗠𝗘𝗡𝗨 \n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣ ඬ⃟ 💎 .𝗮𝗰𝘁𝗶𝘃𝗲\n┣ ඬ⃟ 💎 .𝗮𝗱𝗱\n┣ ඬ⃟ 💎 .𝗮𝗱𝗺𝗶𝗻𝘀/𝘀𝘁𝗮𝗳𝗳\n┣ ඬ⃟ 💎 .𝗮𝘃𝗮𝘁𝗮𝗿/𝗱𝗽\n┣ ඬ⃟ 💎 .𝗰𝗹𝗮𝘀𝗶𝗳𝗳𝗶𝗰𝗮𝘁𝗶𝗼𝗻\n┣ ඬ⃟ 💎 .𝗰𝗹𝗲𝗮𝗿\n┣ ඬ⃟ 💎 .𝗰𝗼𝗻𝗳𝗶𝗴\n┣ ඬ⃟ 💎 .𝗰𝗼𝗻𝗳𝗶𝗴𝘁𝗶𝗺𝗲\n┣ ඬ⃟ 💎 .𝗱𝗮𝘀𝗵𝗯𝗼𝗮𝗿𝗱 \n┣ ඬ⃟ 💎 .𝗱𝗲𝗹𝗲𝘁𝗲\n┣ ඬ⃟ 💎 .𝗲𝗱𝗶𝘁\n┣ ඬ⃟ 💎 .𝗶𝗻𝗮𝗰𝘁𝗶𝘃𝗲\n┣ ඬ⃟ 💎 .𝗶𝗻𝗳𝗼\n┣ ඬ⃟ 💎 .𝗶𝗻𝗳𝗼𝗴𝗿𝗼𝘂𝗽\n┣ ඬ⃟ 💎 .𝗸𝗶𝗰𝗸\n┣ ඬ⃟ 💎 .𝗹𝗶𝗻𝗸\n┣ ඬ⃟ 💎 .𝗹𝗶𝘀𝘁𝗻𝘂𝗺/𝗸𝗶𝗰𝗸𝗻𝘂𝗺\n┣ ඬ⃟ 💎 .𝘄𝗮𝗿𝗻\n┣ ඬ⃟ 💎 .𝗹𝗶𝘀𝘁𝗼𝗻𝗹𝗶𝗻𝗲\n┣ ඬ⃟ 💎 .𝗽𝗼𝗹𝗹\n┣ ඬ⃟ 💎 .𝗽𝗿𝗼𝗺𝗼𝘁𝗲\n┣ ඬ⃟ 💎 .𝗿𝗲𝘃𝗼𝗸𝗲\n┣ ඬ⃟ 💎 .𝘀𝗲𝘁𝗯𝘆𝗲\n┣ ඬ⃟ 💎 .𝘀𝗲𝘁𝗻𝗮𝗺𝗲\n┣ ඬ⃟ 💎 .𝗦𝗲𝘁𝗽𝗽𝗴𝗿𝗼𝘂𝗽\n┣ ඬ⃟ 💎 .𝘀𝗲𝘁𝘄𝗲𝗹𝗰𝗼𝗺𝗲\n┣ ඬ⃟ 💎 .𝘁𝗮𝗴𝗮𝗹𝗹\n┣ ඬ⃟ 💎 .𝘂𝗻𝘄𝗮𝗿𝗻\n┣ ඬ⃟ 💎 .𝘄𝗮𝗿𝗻\n┣ ඬ⃟ 💎 .𝗶𝗻𝘃𝗶𝘁𝗲\n┣ ඬ⃟ 💎 .𝘁𝗼𝘁𝗮𝗴\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━━\n┃*<🪀𝐓𝐑𝐀𝐂𝐄 𝗜𝗡𝗙𝗢-𝗠𝗘𝗡𝗨\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣ ⃟ 💟 .𝗰𝗹𝗲𝗮𝗿 \n┣ ⃟ 💟 .𝗰𝗼𝘃𝗶𝗱\n┣ ⃟ 💟 .𝗰𝗿𝗲𝗮𝘁𝗼𝗿\n┣ ⃟ 💟 .𝗱𝗮𝘁𝗮𝗯𝗮𝘀𝗲\n┣ ⃟ 💟 .𝗴𝗿𝗼𝘂𝗽𝗹𝗶𝘀𝘁\n┣ ⃬⃟ 💟 .𝗴𝗿𝗼𝘂𝗽𝘀𝗼𝗳𝗰\n┣┣⃟ 💟 .𝗹𝗶𝘀𝘁𝗽𝗿𝗲𝗺\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━━\n┃ *<𝐓𝐑𝐀𝐂𝐄 𝗜𝗡𝗧𝗘𝗥𝗡𝗘𝗧-𝗠𝗘𝗡𝗨\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣ ⃟ 🔍 .𝗮𝗻𝗶𝗺𝗲𝗶𝗻𝗳𝗼\n┣ ⃟ 🔍 .𝗴𝗶𝗺𝗮𝗴𝗲\n┣ ⃟ 🔍 .𝗴𝗶𝘁𝗵𝘂𝗯𝘀𝗲𝗮𝗿𝗰𝗵\n┣ ⃟ 🔍 .𝗴𝗼𝗼𝗴𝗹𝗲\n┣ ⃟ 🔍 .𝗶𝘁𝘂𝗻𝗲𝘀\n┣ ⃟ 🔍 .𝗹𝘆𝗿𝗶𝗰𝘀\n┣ ⃟ 🔍 .𝗺𝗼𝘃𝗶𝗲𝘀\n┣ ⃟ 🔍 .𝗽𝗹𝗮𝘆𝘀𝘁𝗼𝗿𝗲\n┣ ⃟ 🔍 .𝘀𝘁𝗶𝗰𝗸𝗲𝗿𝘀𝗲𝗮𝗿𝗰𝗵\n┣ ⃟ 🔍 .𝘄𝗶𝗸𝗶𝗽𝗲𝗱𝗶𝗮\n┣ ⃟ 🔍 .𝘆𝘁𝘀\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━━\n┃𝐓𝐑𝐀𝐂𝐄 𝗠𝗔𝗞𝗘𝗥-𝗠𝗘𝗡𝗨\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣ ⃟✒️ .𝗯𝗹𝘂𝗿\n┣ ⃟✒️ .𝗰𝗮𝗿𝘁𝗼𝗼𝗻/𝘁𝗼𝗰𝗮𝗿𝘁𝗼𝗼𝗻\n┣ ⃟✒️ .𝗴𝗮𝘆\n┣ ⃟✒️ .𝗵𝗼𝗿𝗻𝗰𝗮𝗿𝗱\n┣ ⃟✒️ .𝗶𝘁𝘀𝘀𝗼𝘀𝘁𝘂𝗽𝗶𝗱\n┣ ⃟✒️ .𝗹𝗼𝗴𝗼\n┣ ⃟✒️ .𝗽𝗵𝗺𝗮𝗸𝗲𝗿\n┣ ⃟✒️ .𝗽𝗶𝘅𝗲𝗹\n┣ ⃟✒️ .𝘀𝗶𝗺𝗽𝗰𝗰𝗮𝗿𝗱\n┣ ⃟✒️ .𝘁𝗼𝗮𝗻𝗶𝗺𝗲\n┣ ⃟✒️ .𝘆𝘁𝗰𝗼𝗺𝗺𝗮𝗻𝗱\n┣ ⃟✒️ .𝗮𝗻𝗶𝗺𝗲𝘀\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━━\n┃𝐓𝐑𝐀𝐂𝐄 𝗢𝗪𝗡𝗘𝗥-𝗠𝗘𝗡𝗨\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣ ⃟ 👑 .𝗮𝗱𝗱𝗼𝘄𝗻𝗲𝗿 @𝘂𝘀𝗲𝗿 \n┣ ⃟ 👑 .𝗱𝗲𝗹𝗼𝘄𝗻𝗲𝗿 @𝘂𝘀𝗲𝗿\n┣ ⃟ 👑 .𝗮𝗱𝗱𝗺𝘀𝗴\n┣ ⃟ 👑 .𝗮𝗱𝗱𝗽𝗿𝗲𝗺\n┣ ⃟ 👑 .𝗮𝘂𝘁𝗼𝗮𝗱𝗺𝗶𝗻\n┣ ⃟ 👑 .𝗯𝗮𝗰𝗸𝘂𝗽\n┣ ⃟ 👑 .𝗯𝗮𝗻𝗰𝗵𝗮𝘁\n┣ ⃟ 👑 .𝗯𝗮𝗻𝗹𝗶𝘀𝘁\n┣ ⃟ 👑 .𝗯𝗮𝗻𝘂𝘀𝗲𝗿 @𝘂𝘀𝗲𝗿\n┣ ⃟ 👑 .𝗯𝗰𝗴𝗰\n┣ ⃟ 👑 .𝗯𝗹𝗼𝗰𝗸\n┣ ⃟ 👑 .𝘂𝗻𝗯𝗹𝗼𝗰𝗸\n┣ ⃟ 👑 .𝗯𝗹𝗼𝗰𝗸𝗹𝗶𝘀𝘁\n┣ ⃟ 👑 .𝗯𝗿𝗼𝗮𝗱𝗰𝗮𝘀𝘁𝗰𝗵𝗮𝘁𝘀\n┣ ⃟ 👑 .𝗯𝗰/𝘁𝘅\n┣ ⃟ 👑 .𝗯𝗰𝗴𝗰2\n┣ ⃟ 👑 .𝗰𝗹𝗲𝗮𝗿𝘁𝗺𝗽\n┣ ⃟ 👑 .𝗱𝗲𝗹𝗺𝘀𝗴\n┣ ⃟ 👑 .𝗸𝗶𝗹𝗹𝗴𝗰\n┣ ⃟ 👑 .𝗱𝗲𝗺𝗼𝘁𝗲𝗮𝗹𝗹\n┣ ⃟ 👑 .𝗽𝗿𝗼𝗺𝗼𝘁𝗲𝗮𝗹𝗹\n┣ ⃟ 👑 .𝗱𝗲𝗹𝗽𝗿𝗲𝗺\n┣ ⃟ 👑 .𝗱𝗳\n┣ ⃟ 👑 .𝗲𝘅𝗲𝗰 2\n┣ ⃟ 👑 .𝗳𝗲𝘁𝗰𝗵\n┣ ⃟ 👑 .𝗴𝗲𝘁𝗱𝗯\n┣ ⃟ 👑 .𝗴𝗲𝘁𝗺𝘀𝗴\n┣ ⃟ 👑 .𝗴𝗲𝘁𝗽𝗹𝘂𝗴𝗶𝗻\n┣ ⃟ 👑 .𝗴𝗲𝘁𝘀𝗲𝘀𝘀𝗶𝗼𝗻\n┣ ⃟ 👑 .𝗶𝗻𝗳𝗶𝗻𝗶𝘁𝘆\n┣ ⃟ 👑 .𝗶𝗻𝘀𝗽𝗲𝗰𝘁 (𝗹𝗶𝗻𝗸)\n┣ ⃟ 👑 .𝗷𝗼𝗶𝗻\n┣ ⃟ 👑 .𝗹𝗲𝗮𝘃𝗲\n┣ ⃟ 👑 .𝗹𝗶𝘀𝘁𝗺𝘀𝗴\n┣ ⃟ 👑 .𝗹𝗼𝗴𝗼𝘂𝘁\n┣ ⃟ 👑 .𝗺𝗼𝗻𝗶𝘁𝗼𝗿\n┣ ⃟ 👑 .𝗺𝘀𝗴 \n┣ ⃟ 👑 .𝗿𝗲𝗽𝗼𝗿𝘁\n┣ ⃟ 👑 .𝗿𝗲𝘀𝗲𝘁𝗽𝗿𝗲𝗳𝗶𝘅\n┣ ⃟ 👑 .𝗿𝗲𝘀𝗲𝘁𝘂𝘀𝗲𝗿\n┣ ⃟ 👑 .𝗿𝗲𝘀𝘁𝗮𝗿𝘁\n┣ ⃟ 👑 .𝘀𝗮𝘃𝗲𝗶𝗺𝗮𝗴𝗲\n┣ ⃟ 👑 .𝘀𝗲𝘁𝗽𝗽𝗯𝗼𝘁\n┣ ⃟ 👑 .𝘀𝗲𝘁𝗽𝗿𝗲𝗳𝗶𝘅 \n┣ ⃟ 👑 .𝘀𝗳\n┣ ⃟ 👑 .𝘀𝘂𝗽𝗽𝗼𝗿𝘁𝘄𝗮\n┣ ⃟ 👑 .𝘂𝗻𝗯𝗮𝗻𝗰𝗵𝗮𝘁\n┣ ⃟ 👑 .𝘂𝗻𝗯𝗹𝗼𝗰𝗸\n┣ ⃟ 👑 .𝘂𝗽𝗱𝗮𝘁𝗲\n┣ ⃟ 👑 .𝘃𝗶𝗲𝘄𝗶𝗺𝗮𝗴𝗲\n┣ ⃟ 👑 .𝘃𝗶𝗿𝘂𝘀/𝗰2/𝘁𝗿𝗮𝗯𝗮5/𝘁𝗿𝗮𝗯𝗮\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━┓\n┃𝐓𝐑𝐀𝐂𝐄 𝗥𝗔𝗡𝗗𝗢𝗠-𝗠𝗘𝗡𝗨\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣ ඬ⃟ 👾 .𝗮𝗻𝗶𝗺𝗲\n┣ ඬ⃟ 👾 .𝗯𝗹𝗮𝗰𝗸𝗽𝗶𝗻𝗸\n┣ ඬ⃟ 👾 .𝗰𝗿7\n┣ ඬ⃟ 👾 .𝗰𝗮𝘁\n┣ ඬ⃟ 👾 .𝗱𝗼𝗴\n┣ ඬ⃟ 👾 .𝗶𝘁𝘇𝘆\n┣ ඬ⃟ 👾 .𝗸𝗽𝗼𝗽\n┣ ඬ⃟ 👾 .𝗹𝗼𝗹𝗶\n┣ ඬ⃟ 👾 .𝗹𝗼𝗹𝗶𝘃𝗶𝗱\n┣ ඬ⃟ 👾 .𝗺𝗲𝘀𝘀𝗶\n┣ ඬ⃟ 👾 .𝗻𝗮𝘃𝗶𝗱𝗮𝗱\n┣ ඬ⃟ 👾 .𝗻𝗲𝗸𝗼\n┣ ඬ⃟ 👾 .𝗽𝗽𝗰𝗽\n┣ ඬ⃟ 👾 .𝘄𝗮𝗶𝗳𝘂\n┣ ඬ⃟ 👾 .𝗰𝗼𝘂𝗿𝘀𝗲𝘀\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━━\n┃𝐓𝐑𝐀𝐂𝐄 𝗥𝗣𝗚-𝗠𝗘𝗡𝗨\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣ ⃟ 💵 .𝗮𝗱𝗱𝘅𝗽 @𝘁𝗮𝗴\n┣ ⃟ 💵 .𝗮𝗱𝘃𝗲𝗻𝘁𝘂𝗿𝗲\n┣ ⃟ 💵 .𝗯𝗮𝗹𝗮𝗻𝗰𝗲\n┣ ⃟ 💵 .𝗱𝗮𝗶𝗹𝘆\n┣ ⃟ 💵 .𝗱𝗮𝗶𝗹𝘆2\n┣ ⃟ 💵 .𝗵𝗲𝗮𝗹\n┣ ⃟ 💵 .𝗵𝘂𝗻𝘁\n┣ ⃟ 💵 .𝗹𝗲𝗮𝗱𝗲𝗿𝗯𝗼𝗮𝗿𝗱\n┣ ⃟ 💵 .𝗹𝗲𝘃𝗲𝗹𝘂𝗽\n┣ ⃟ 💵 .𝗺𝗶𝗻𝗲\n┣ ⃟ 💵 .𝗺𝘆𝗻𝘀\n┣ ⃟ 💵 .𝗽𝗿𝗼𝗳𝗶𝗹𝗲\n┣ ⃟ 💵 .𝗿𝗼𝗯\n┣ ⃟ 💵 .𝗯𝘂𝘆\n┣ ⃟ 💵 .𝗺𝗶𝗻𝗲2\n┣ ⃟ 💵 .𝘁𝗿𝗮𝗻𝘀𝗳𝗲𝗿\n┣ ⃟ 💵 .𝘂𝗻𝗿𝗲𝗴\n┣ ⃟ 💵 .𝘃𝗲𝗿𝗶𝗳𝘆\n┣ ⃟ 💵 .𝘄𝗼𝗿𝗸\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━━\n┃𝐓𝐑𝐀𝐂𝐄 𝗦𝗧𝗜𝗖𝗞𝗘𝗥-𝗠𝗘𝗡𝗨\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣ ඬ⃟ 👽 .𝘀𝗰𝗶𝗿𝗰𝗹𝗲/𝗰𝗶𝗿𝗰𝗹𝗲 (𝘁𝗮𝗴 𝘀𝘁𝗶𝗰𝗸𝗲𝗿)\n┣ ඬ⃟ 👽 .𝗱𝗮𝗱𝗼\n┣ ඬ⃟ 👽 .𝗴𝗲𝘁𝘀𝘁𝗶𝗰𝗸𝗲𝗿\n┣ ඬ⃟ 👽 .𝗸𝗶𝘀𝘀\n┣ ඬ⃟ 👽 .𝗽𝗮𝘁\n┣ ඬ⃟ 👽 .𝗾𝗰\n┣ ඬ⃟ 👽 .𝘀𝗲𝗺𝗼𝗷𝗶\n┣ ඬ⃟ 👽 .𝘀𝗹𝗮𝗽\n┣ ඬ⃟ 👽 .𝘀𝗺𝗲𝗺𝗲\n┣ ඬ⃟ 👽 .𝘀𝗿𝗲𝗺𝗼𝘃𝗲𝗯𝗴\n┣ ඬ⃟ 👽 .𝘀𝘁𝗶𝗰𝗸𝗲𝗿\n┣ ඬ⃟ 👽 .𝘀𝘁𝗶𝗰𝗸𝗲𝗿𝗳𝗶𝗹𝘁𝗲𝗿\n┣ ඬ⃟ 👽 .𝘀𝗺𝗮𝗸𝗲𝗿\n┣ ඬ⃟ 👽 .𝗮𝘁𝘁𝗽\n┣ ඬ⃟ 👽 .𝗮𝘁𝘁𝗽2\n┣ ඬ⃟ 👽 .𝗮𝘁𝘁𝗽3\n┣ ඬ⃟ 👽 .𝘁𝘁𝗽5\n┣ ඬ⃟ 👽 .𝘁𝘁𝗽4\n┣ ඬ⃟ 👽 .𝘁𝘁𝗽3\n┣ ඬ⃟ 👽 .𝘁𝘁𝗽2\n┣ ඬ⃟ 👽 .𝘁𝘁𝗽\n┣ ඬ⃟ 👽 .𝘁𝗮𝗸𝗲/𝘀𝘁𝗲𝗮𝗹\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━━\n┃𝐓𝐑𝐀𝐂𝐄 𝗧𝗢𝗢𝗟𝗦-𝗠𝗘𝗡𝗨\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣ ⃟ 🛠️ .𝗰𝗮𝗹𝗰\n┣ ⃟ 🛠️ .𝗰𝗮𝗿𝗯𝗼𝗻\n┣ ⃟ 🛠️ .𝗰𝗹𝗶𝗺𝗮𝘁𝗲\n┣ ⃟ 🛠️ .𝗱𝗮𝗹𝗹𝗲\n┣ ⃟ 🛠️ .𝗱𝗲𝗳𝗶𝗻𝗲\n┣ ⃟ 🛠️ .𝗱𝗿𝗼𝗽𝗺𝗮𝗮𝗶𝗹\n┣ ⃟ 🛠️ .𝗲𝗹𝗲𝗺𝗲𝗻𝘁\n┣ ⃟ 🛠️ .𝗳𝗮𝗸𝗲𝗿𝗲𝗽𝗹𝘆\n┣ ⃟ 🛠️ .𝗴𝗲𝘁𝗯𝗶𝗼\n┣ ⃟ 🛠️ .𝗵𝗱\n┣ ⃟ 🛠️ .𝗶𝗻𝘀𝗽𝗲𝗰𝘁\n┣ ⃟ 🛠️ .𝗺𝘂𝘁𝗲\n┣ ⃟ 🛠️ .𝗻𝗼𝘄𝗮\n┣ ⃟ 🛠️ .𝗼𝗰𝗿\n┣ ⃟ 🛠️ .𝗾𝗿𝗰𝗼𝗱𝗲\n┣ ⃟ 🛠️ .𝗿𝗲𝗮𝗱𝗺𝗼𝗿𝗲\n┣ ⃟ 🛠️ .𝗿𝗲𝗮𝗱𝗾𝗿\n┣ ⃟ 🛠️ .𝗿𝗲𝗮𝗱𝘃𝗶𝗲𝘄𝗼𝗻𝗰𝗲/𝗿𝗲𝗮𝗱𝘃𝗼/𝘃𝘃\n┣ ⃟ 🛠️ .𝗿𝗲𝘀𝗶𝘇𝗲\n┣ ⃟ 🛠️ .𝘀𝘀𝘄𝗲𝗯\n┣ ⃟ 🛠️ .𝘀𝘁𝘆𝗹𝗲𝘁𝗲𝘅𝘁\n┣ ⃟ 🛠️ .𝘀𝘆𝗺𝗯𝗼𝗹𝘀\n┣ ⃟ 🛠️ .𝘁𝗲𝗰𝗵𝗻𝗲𝘄𝘀\n┣ ⃟ 🛠️ .𝘁𝗲𝗺𝗽𝗺𝗮𝗶𝗹\n┣ ⃟ 🛠️ .𝘁𝗶𝗻𝘆𝘂𝗿𝗹\n┣ ⃟ 🛠️ .𝘁𝗼𝗽𝗱𝗳\n┣ ⃟ 🛠️ .𝘁𝗿𝗮𝗻𝘀𝗹𝗮𝘁𝗲\n┣ ⃟ 🛠️ .𝘄𝗮𝘀𝘁𝗲\n┣ ⃟ 🛠️ .𝘄𝗵𝗮𝘁𝗺𝘂𝘀𝗶𝗰/𝘀𝗵𝗮𝘇𝗮𝗺\n┣ ⃟ 🛠️ .𝘄𝗼𝗿𝗹𝗱𝗰𝗹𝗼𝗰𝗸\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━━\n┃𝐓𝐑𝐀𝐂𝐄 𝗡𝗦𝗙𝗪-𝗠𝗘𝗡𝗨\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗽𝗮𝗰𝗸_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗽𝗮𝗰𝗸2_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗽𝗮𝗰𝗸3_/\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝘃𝗶𝗱𝗲𝗼𝘅𝘅𝘅_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝘃𝗶𝗱𝗲𝗼𝗹𝗲𝘀𝗯𝗶𝘅𝘅𝘅_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗯𝗼𝗼𝗯𝘀_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗯𝗼𝗼𝘁𝘆_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗲𝗰𝗰𝗵𝗶_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗳𝘂𝗿𝗿𝗼_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗶𝗺𝗮𝗴𝗲𝗹𝗲𝘀𝗯𝗶𝗮𝗻𝘀_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗽𝗮𝗻𝘁𝗶𝗲𝘀_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗽𝗲𝗻𝗲_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗽𝗼𝗿𝗻_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗿𝗮𝗻𝗱𝗼𝗺𝘅𝘅𝘅_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗯𝗿𝗲𝗮𝘀𝘁𝘀_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝘆𝗮𝗼𝗶_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝘆𝗮𝗼𝗶2_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝘆𝘂𝗿𝗶_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝘆𝘂𝗿𝗶2_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝘁𝗿𝗮𝗽𝗶𝘁𝗼_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗵𝗲𝗻𝘁𝗮𝗶_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗻𝘀𝗳𝘄𝗹𝗼𝗹𝗶_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗻𝘀𝗳𝘄𝗼𝗿𝗴𝘆_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗻𝘀𝗳𝘄𝗳𝗼𝗼𝘁_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗻𝘀𝗳𝘄𝗮𝘀𝘀_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗻𝘀𝗳𝘄𝗯𝗱𝘀𝗺_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗻𝘀𝗳𝘄𝗰𝘂𝗺_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗻𝘀𝗳𝘄𝗲𝗿𝗼_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗻𝘀𝗳𝘄𝗳𝗲𝗺𝗱𝗼𝗺_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗻𝘀𝗳𝘄𝗴𝗹𝗮𝘀𝘀_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗵𝗲𝗻𝘁𝗮𝗶𝗽𝗱𝗳 *<text>*_\n┣ ⃟ 🔞 _" + _0xa30c3b + "𝗵𝗲𝗻𝘁𝗮𝗶𝘀𝗲𝗮𝗿𝗰𝗵 *<text>*_\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━━\n┃𝐓𝐑𝐀𝐂𝐄 𝗔𝗨𝗗𝗜𝗢𝗦-𝗠𝗘𝗡𝗨\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┃*- Happy Birthday to you*\n┣ _" + _0xa30c3b + "𝗯𝗮𝘀𝘀_\n┣ _" + _0xa30c3b + "𝗯𝗹𝗼𝘄𝗻_\n┣ _" + _0xa30c3b + "𝗱𝗲𝗲𝗽_\n┣ _" + _0xa30c3b + "𝗲𝗮𝗿𝗿𝗮𝗽𝗲_\n┣ _" + _0xa30c3b + "𝗳𝗮𝘀𝘁_\n┣ _" + _0xa30c3b + "𝗳𝗮𝘁_\n┣ _" + _0xa30c3b + "𝗻𝗶𝗴𝗵𝘁𝗰𝗼𝗿𝗲_\n┣ _" + _0xa30c3b + "𝗿𝗲𝘃𝗲𝗿𝘀𝗲_\n┣ _" + _0xa30c3b + "𝗿𝗼𝗯𝗼𝘁_\n┣ _" + _0xa30c3b + "𝘀𝗹𝗼𝘄_\n┣ _" + _0xa30c3b + "𝘀𝗺𝗼𝗼𝘁𝗵_\n┣ _" + _0xa30c3b + "𝘄𝗵𝗼𝗲𝘃𝗲𝗿_\n┗━━━━━━━━━━━━━━━━┛\n\n┏━━━━━━━━━━━━━━━━━\n┃𝐓𝐑𝐀𝐂𝐄 𝗔𝗨𝗧𝗢-𝗔𝗨𝗗𝗜𝗢𝗦\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┃ *- WRITE THE FOLLOWING WORDS OR PHRASES WITHOUT ANY PREFIX (#, /, *, .)*\n┃ _- (USE WITHOUT PREFIX)_\n┃≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡┃\n┣ _𝗮𝗱𝗺𝗶𝗻\n┣ _𝘀𝗶𝗺𝗽\n┣ _𝘀𝗮𝗻𝗮\n┣ _𝗕𝗮𝗻𝗻𝗻𝗲𝗱_\n┣ _𝗯𝗲𝗲_\n┣ _𝗯𝘂𝗺𝗯𝗹𝗲𝗯𝗲𝗲_\n┣ _𝗯𝗼𝘁_\n┣ _𝗮𝗮𝗵_\n┣ _𝘀𝗶𝘂𝘂𝘂_\n┣ _𝘀𝗲𝘅_\n┣ _𝗳𝘂𝗰𝗸_\n┣ _𝗵𝗲𝘆_\n┣ _𝗰𝗮𝗹𝗹_\n┣ _𝗸𝗵𝗮𝗹𝗶-𝗱_\n┣ _𝗴𝗮𝘆_\n┗━━━━━━━━━━━━━━━━┛").trim();
    if (_0xfe75e0.isGroup) {
      let _0xa3615c = {
        'key': {
          'participants': "0@s.whatsapp.net",
          'remoteJid': "status@broadcast",
          'fromMe': false,
          'id': "Halo"
        },
        'message': {
          'contactMessage': {
            'vcard': "BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=" + _0xfe75e0.sender.split('@')[0] + ':' + _0xfe75e0.sender.split('@')[0] + "\nitem1.X-ABLabel:Ponsel\nEND:VCARD"
          }
        },
        'participant': "0@s.whatsapp.net"
      };
      _0x17c30a.sendMessage(_0xfe75e0.chat, {
        'image': imagen6,
        'caption': _0x14f1f6.trim(),
        'mentions': [..._0x14f1f6.matchAll(/@([0-9]{5,16}|0)/g)].map(_0x5b58ed => _0x5b58ed[1] + "@s.whatsapp.net")
      }, {
        'quoted': _0xa3615c
      });
    } else {
      let _0x25b47b = {
        'key': {
          'participants': "0@s.whatsapp.net",
          'remoteJid': "status@broadcast",
          'fromMe': false,
          'id': "Halo"
        },
        'message': {
          'contactMessage': {
            'vcard': "BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=" + _0xfe75e0.sender.split('@')[0] + ':' + _0xfe75e0.sender.split('@')[0] + "\nitem1.X-ABLabel:Ponsel\nEND:VCARD"
          }
        },
        'participant': "0@s.whatsapp.net"
      };
      _0x17c30a.sendMessage(_0xfe75e0.chat, {
        'image': imagen6,
        'caption': _0x14f1f6.trim(),
        'mentions': [..._0x14f1f6.matchAll(/@([0-9]{5,16}|0)/g)].map(_0x9fb3df => _0x9fb3df[1] + "@s.whatsapp.net")
      }, {
        'quoted': _0x25b47b
      });
    }
  } catch {
    _0x17c30a.reply(_0xfe75e0.chat, "*[🚫]THE MENU HAS AN ERROR AND IT IS NOT POSSIBLE TO SEND IT REPORT IT TO THE OWNER OF THE BOT*", _0xfe75e0);
  }
};
handler.command = /^(menu|menú|memu|memú|help|info|comandos|allmenu|2help|menu1.2|ayuda|commands|commandos|cmd)$/i;
handler.exp = 50;
handler.fail = null;
export default handler;
function clockString(_0x4766a3) {
  let _0x1d043d = isNaN(_0x4766a3) ? '--' : Math.floor(_0x4766a3 / 3600000);
  let _0x1c15b5 = isNaN(_0x4766a3) ? '--' : Math.floor(_0x4766a3 / 60000) % 60;
  let _0x4672fa = isNaN(_0x4766a3) ? '--' : Math.floor(_0x4766a3 / 1000) % 60;
  return [_0x1d043d, _0x1c15b5, _0x4672fa].map(_0x330ce4 => _0x330ce4.toString().padStart(2, 0)).join(':');
}
